function y=inputvar(I)
% inputvar   特征提取
b = find(I>130);%I：读入的待辨认的数字图片，find(I>130)：找出I中大于130的坐标，返回的是线性索引
I(b) = 1;%将图像中大于130的地方置1
 % 对数字图片进行二值化处理，读入的图片形式简单以致于二值化方法简单
% 图像预处理部分

[m,n] = size(I);%获取图片的尺寸,m=16,n=8
p = zeros(1,17);%产生一个1*17的零向量
for k=1:4
    for i=1+(k-1)*4:m/4+(k-1)*4
        for j=1:n/2
            if I(i,j)==0
                p(k) = p(k)+1;
            else
                p(k) = p(k);
            end
        end
        for j=n/2+1:n
            if I(i,j)==0
                p(k+4) = p(k+4)+1;
            else
                p(k+4) = p(k+4);
            end
        end
    end
end
 % 把图片分成八个独立区域计算各自的图象密度,作为部分特征向量
p(9) = p(1)+p(2);
p(10) = p(3)+p(4);
p(11) = p(5)+p(6);
p(12) = p(7)+p(8);
p(13) = p(1)+p(5);
p(14) = p(2)+p(6);
p(15) = p(3)+p(7);
p(16) = p(4)+p(8);
p(17) = p(9)+p(10)+p(11)+p(12);
y = p/128;
 % 合并区域的图像密度作为其他部分特征向量
